#include<stdio.h>
int main() {
//0————————————————————————————————————————————————————————————
	//int v[3] = { 1,2,3 };//(int (*) [3])&v 指標  指向 由三個元素所構成的整數陣列
	//
	//int (*q)[3] = &v;

	////循序存取
	//int i;
	//for (i = 0; i < 3; i++) {
	//	(*q)[i] = 0; 
	//}

	////隨機存取
	//(*q)[2] = 5;

//1————————————————————————————————————————————————————————————
	void print(int(*q)[3]) {
		int i;
		for (i = 0; i < 3; i++) {
			printf("%d ", (*q)[i]);
		}
		pirntf("\n");
	}

	int main() {
		int v[3] = { 1,2,3 };
		print(&v);	//&v代表數組的位址
		return 0;
	}

//2————————————————————————————————————————————————————————————
	//常用版本
	void print(int *n]) {
		int i;
		for (i = 0; i < 3; i++) {
			printf("%d ", n[i]);
		}
		pirntf("\n");
	}

	int main() {
		int v[3] = { 1,2,3 };
		print(v);	//v[0]==v代表第一個元素的位址
		return 0;
	}

	return 0;
}