#include<stdint.h>

int main(){
	int* p[3] = { 1,2,3 };	//p[0](int *),p[1](int *),p[2](int *)
	int* p[3] = { &v[0],&v[1],&v[2] };	//p[0](int *)&v[0],p[1](int *)&v[1],p[2](int *)&v[2]
//0¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª
	int v[3] = { 1,2,3 };
	int* p[3] = {&v[0],&v[1],&v[2]};

	//Ñ­Ðò´æÈ¡
	int i;
	for (i = 0; i < 3; i++) {
		*p[i] = 0;
	}
	
	//ëS™C´æÈ¡
	*p[2] = 5;

//1¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª
	int v[3] = { 1,2,3 };
	int* n = v;

	//Ñ­Ðò´æÈ¡
	int i;
	for (i = 0; i < 3; i++) {
		n[i] = 0;
	}

	//ëS™C´æÈ¡
	n[2] = 5;

//2¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª
	int v[3] = { 1,2,3 };
	int* n = v;

	//Ñ­Ðò´æÈ¡
	int i;
	for (i = 0; i < 3; i++) {
		n[i] = 0;
	}

	//ëS™C´æÈ¡
	n[2] = 5;

//3¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª
	int a = 1, b = 2, c = 3;
	int* p[3] = { &a,&b,&c };

	//Ñ­Ðò´æÈ¡
	int i;
	for (i = 0; i < 3; i++) {
		*p[i] = 0;
	}

	//ëS™C´æÈ¡
	n[2] = 5;

//4¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª
	int a[2] = { 1,2 };
	int b[2] = { 3,4 };
	int c[2] = { 5,6 };

	int* p[3] = { a,b,c };

	//Ñ­Ðò´æÈ¡
	int i,j;
	for (i = 0; i < 3; i++) {
		for (j = 0; j < 2; j++){
			p[i][j] = 0;
		}
	}

	//ëS™C´æÈ¡
	p[2][0] = 7;	//(&c[0])+[0]=7;

//5¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª¡ª
	int a[4] = { 1,2,7,8 };
	int b[2] = { 3,4 };
	int c[2] = { 5,6 };

	int* p[3] = { a,b,c };

	//Ñ­Ðò´æÈ¡
	int i, j;
	for (i = 0; i < 3; i++) {
		for (j = 0; j < 2; j++) {
			p[i][j] = 0;
		}
	}

	//ëS™C´æÈ¡
	p[0][2] = 9;	
	p[1][2] = 10;	//(X) Î´¶¨ÁxÐÐ ‘  ³¬³öê‡ÁÐ¹ ‡ú

	return 0;
}